Repository: ashvisualtheme/file-integrity-scanner
Catalog: locale/*/locale.po
Languages: id_id

# plugins.generic.fileIntegrity.description
source: Verifies the integrity of OJS core and plugin files by comparing them against official baselines to detect unauthorized changes. Developed by Ashvisual Theme. <a href='https://demo-ojs.ashvisual.com'>See also our professional OJS themes</a>
id_id: Memverifikasi integritas berkas inti dan plugin OJS dengan membandingkannya dengan baseline resmi untuk mendeteksi perubahan yang tidak sah. Dikembangkan oleh Ashvisual Theme. <a href='https://demo-ojs.ashvisual.com'>Lihat juga tema OJS profesional kami</a>

# plugins.generic.fileIntegrity.scan.run
source: Run Manual Scan
id_id: Jalankan Scan Manual

# plugins.generic.fileIntegrity.scan.run.description
source: This will perform a full, on-demand scan of your OJS files. The scan may take a few moments. Are you sure you want to proceed?
id_id: Ini akan melakukan pemindaian penuh dan sesuai permintaan terhadap berkas OJS Anda. Pemindaian mungkin memerlukan beberapa saat. Apakah Anda yakin ingin melanjutkan?

# plugins.generic.fileIntegrity.scan.success
source: Scan completed. If any issues were found, a summary has been sent to the site's primary contact email.
id_id: Pemindaian selesai. Jika ditemukan masalah, ringkasan telah dikirim ke email kontak utama situs.

# plugins.generic.fileIntegrity.scan.error
source: The file integrity scan could not be completed. Please check the PHP error log for more details.
id_id: Pemindaian integritas berkas tidak dapat diselesaikan. Silakan periksa log kesalahan PHP untuk detail lebih lanjut.

# plugins.generic.fileIntegrity.cache.clear
source: Clear Hash Cache
id_id: Bersihkan Cache Hash

# plugins.generic.fileIntegrity.cache.clear.description
source: This will delete all cached baseline hash files. The cache will be rebuilt on the next scan. This is useful if you suspect the cache is corrupt. Are you sure you want to proceed?
id_id: Ini akan menghapus semua berkas hash baseline yang di-cache. Cache akan dibangun kembali pada pemindaian berikutnya. Ini berguna jika Anda menduga cache rusak. Apakah Anda yakin ingin melanjutkan?

# plugins.generic.fileIntegrity.cache.clear.success
source: The hash cache has been successfully cleared.
id_id: Cache hash telah berhasil dibersihkan.

# plugins.generic.fileIntegrity.email.subject
source: File Integrity Scan Alert: Issues Detected
id_id: Peringatan Pemindaian Integritas Berkas: Masalah Terdeteksi

# plugins.generic.fileIntegrity.email.subject.noIssues
source: File Integrity Scan Report: No Issues Detected
id_id: Laporan Pemindaian Integritas Berkas: Tidak Ada Masalah Terdeteksi

# plugins.generic.fileIntegrity.email.body.issues
source: The daily file integrity scan has detected one or more changes in your OJS installation files. Please carefully review the summary below to determine if these changes were intentional (e.g., due to a recent software upgrade or configuration change) or if they require further investigation as a potential security issue.
id_id: Pemindaian integritas berkas harian telah mendeteksi satu atau lebih perubahan pada berkas instalasi OJS Anda. Harap tinjau ringkasan di bawah ini dengan cermat untuk menentukan apakah perubahan ini disengaja (misalnya, karena peningkatan perangkat lunak atau perubahan konfigurasi baru-baru ini) atau jika memerlukan penyelidikan lebih lanjut sebagai potensi masalah keamanan.

# plugins.generic.fileIntegrity.email.body.noIssues
source: The daily file integrity scan has completed successfully. No unauthorized modifications, additions, or deletions were detected in your OJS installation files. This confirms that your core application and plugin files match the official baselines. No action is required at this time.
id_id: Pemindaian integritas berkas harian telah berhasil diselesaikan. Tidak ada modifikasi, penambahan, atau penghapusan yang tidak sah terdeteksi pada berkas instalasi OJS Anda. Ini menegaskan bahwa aplikasi inti dan berkas plugin Anda sesuai dengan baseline resmi. Tidak ada tindakan yang diperlukan saat ini.

# plugins.generic.fileIntegrity.email.body.modified
source: Modified Files
id_id: Berkas yang Dimodifikasi

# plugins.generic.fileIntegrity.email.body.modified.description
source: These files have been modified from the official versions. This could indicate file corruption or a security breach.
id_id: Berkas-berkas ini telah dimodifikasi dari versi resmi. Ini bisa mengindikasikan kerusakan berkas atau pelanggaran keamanan.

# plugins.generic.fileIntegrity.email.body.added
source: Added Files
id_id: Berkas yang Ditambahkan

# plugins.generic.fileIntegrity.email.body.added.description
source: These files are not part of the official distribution. They could be leftover files from other plugins or potentially malicious.
id_id: Berkas-berkas ini bukan bagian dari distribusi resmi. Mereka bisa jadi berkas sisa dari plugin lain atau berpotensi berbahaya.

# plugins.generic.fileIntegrity.email.body.deleted
source: Deleted Files
id_id: Berkas yang Dihapus

# plugins.generic.fileIntegrity.email.body.deleted.description
source: These official files are missing from your installation. This could cause system instability or indicate that files were removed by an attacker.
id_id: Berkas-berkas resmi ini hilang dari instalasi Anda. Ini dapat menyebabkan ketidakstabilan sistem atau mengindikasikan bahwa berkas dihapus oleh penyerang.

# plugins.generic.fileIntegrity.email.body.excluded
source: List of excluded Files or Directories
id_id: Daftar Berkas atau Direktori yang Dikecualikan

# plugins.generic.fileIntegrity.email.body.excluded.description
source: These files and directories are intentionally excluded from comparison against the official baseline but are still actively monitored for any local modifications, additions, or deletions. This list includes default critical paths (e.g., <strong>public/</strong> and <strong>config.inc.php</strong>) and any custom paths you've specified in the plugin settings.
id_id: Berkas dan direktori ini sengaja dikecualikan dari perbandingan dengan baseline resmi tetapi masih dipantau secara aktif untuk setiap modifikasi, penambahan, atau penghapusan lokal. Daftar ini mencakup jalur kritis default (misalnya, <strong>public/</strong> dan <strong>config.inc.php</strong>) dan jalur kustom apa pun yang telah Anda tentukan di pengaturan plugin.

# plugins.generic.fileIntegrity.email.body.excludedModified
source: Modified Files in Excluded List
id_id: Berkas yang Dimodifikasi dalam Daftar Pengecualian

# plugins.generic.fileIntegrity.email.body.excludedModified.description
source: The following files, which are part of your monitored exclusions, have been modified since the last integrity scan. This could indicate intentional changes or unauthorized tampering.
id_id: Berkas-berkas berikut, yang merupakan bagian dari pengecualian yang dipantau, telah dimodifikasi sejak pemindaian integritas terakhir. Ini bisa mengindikasikan perubahan yang disengaja atau perusakan yang tidak sah.

# plugins.generic.fileIntegrity.email.body.excludedAdded
source: Added Files in Excluded List
id_id: Berkas yang Ditambahkan dalam Daftar Pengecualian

# plugins.generic.fileIntegrity.email.body.excludedAdded.description
source: The following new files have been detected within your monitored exclusion paths since the last scan. This may indicate new legitimate content or potentially unauthorized file uploads.
id_id: Berkas-berkas baru berikut telah terdeteksi dalam jalur pengecualian yang dipantau sejak pemindaian terakhir. Ini mungkin mengindikasikan konten baru yang sah atau unggahan berkas yang berpotensi tidak sah.

# plugins.generic.fileIntegrity.email.body.excludedDeleted
source: Deleted Files in Excluded List
id_id: Berkas yang Dihapus dalam Daftar Pengecualian

# plugins.generic.fileIntegrity.email.body.excludedDeleted.description
source: The following files, which were previously part of your monitored exclusions, have been deleted since the last scan. Please verify if this removal was intentional.
id_id: Berkas-berkas berikut, yang sebelumnya merupakan bagian dari pengecualian yang dipantau, telah dihapus sejak pemindaian terakhir. Harap verifikasi apakah penghapusan ini disengaja.

# plugins.generic.fileIntegrity.settings.description
source: This plugin automatically scans your OJS installation files for unauthorized changes. You can configure specific files or directories to be excluded from the scan below.
id_id: Plugin ini secara otomatis memindai berkas instalasi OJS Anda untuk perubahan yang tidak sah. Anda dapat mengkonfigurasi berkas atau direktori tertentu untuk dikecualikan dari pemindaian di bawah ini.

# plugins.generic.fileIntegrity.settings.manualExcludes
source: Manual Excludes
id_id: Pengecualian Manual

# plugins.generic.fileIntegrity.settings.manualExcludeInfo
source: Enter paths for files or directories that should be excluded from baseline comparison but <strong>still monitored for local changes</strong>. This is useful for files you intentionally modify (like <strong>.htaccess</strong>) or directories for user-uploaded content. Enter one path per line, relative to your OJS root directory.
id_id: Masukkan jalur untuk berkas atau direktori yang harus dikecualikan dari perbandingan baseline tetapi <strong>masih dipantau untuk perubahan lokal</strong>. Ini berguna untuk berkas yang sengaja Anda modifikasi (seperti <strong>.htaccess</strong>) atau direktori untuk konten yang diunggah pengguna. Masukkan satu jalur per baris, relatif terhadap direktori root OJS Anda.

# plugins.generic.fileIntegrity.settings.manualExcludes.description
source: <strong>Note: Enter the full path of files or directories to exclude, one per line. e.g.:</strong><br> .htaccess <br> google7tebgr5hcdtth.html <br> plugins/generic/myCustomPlugin
id_id: <strong>Catatan: Masukkan jalur lengkap berkas atau direktori yang akan dikecualikan, satu per baris. Contoh:</strong><br> .htaccess <br> google7tebgr5hcdtth.html <br> plugins/generic/myCustomPlugin
